# ElevAssocDatum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElevAssocDatum Property
ParameterTypeId Class See Also
---
"Associated Datum"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElevAssocDatum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevAssocDatum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElevAssocDatum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace